Witali/yoRadio/esp8266/rtos-sdk-native/main/app_main.c
#include "esp_log.h"
#include "esp_system.h"
#include "sdkconfig.h"
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"

#include "board_config.h"
#include "spi_pdm_config.h"
#include "audio_service.h"
#if YORADIO_ESP8266_OPUS_PCM_APP_TASK
#include "audio_pcm_queue.h"
#include "esp8266_nodac_i2s.h"
#include "esp_timer.h"
#endif
#if CONFIG_YORADIO_OLED
#include "display_service.h"
#endif
#include "input_service.h"
#include "native_audio_output.h"
#include "native_state.h"
#include "network_service.h"
#include "nvs_flash.h"
#include "persistent_settings.h"
#include "playlist_service.h"
#include "radio_control.h"
#include "storage_service.h"
#if CONFIG_YORADIO_STATUS_LED
#include "status_led.h"
#endif
#include "time_service.h"
#include "web_service.h"
#include "memory_profile.h"
#include "spiffs_log.h"

static const char *TAG = "yoradio8266";

#if YORADIO_ESP8266_CODEC_RAM_BENCHMARK
void codec_ram_benchmark_run(void);
#endif
#if YORADIO_ESP8266_AUDIO_OUTPUT_BENCHMARK
void audio_output_benchmark_run(void);
#endif

void app_main(void) {
    memory_profile_register(MEMORY_APP);
#if YORADIO_ESP8266_AUDIO_OUTPUT_BENCHMARK
    ESP_LOGI(TAG, "isolated generated-PCM audio output benchmark; "
                  "Wi-Fi and codecs disabled");
    audio_output_benchmark_run();
    for (;;) vTaskDelay(portMAX_DELAY);
#elif YORADIO_ESP8266_CODEC_RAM_BENCHMARK
    ESP_LOGI(TAG, "isolated codec RAM benchmark; Wi-Fi disabled, audio output=%u",
             (unsigned)YORADIO_ESP8266_CODEC_RAM_AUDIO_OUTPUT);
    codec_ram_benchmark_run();
    for (;;) vTaskDelay(portMAX_DELAY);
#else
    spiffs_log_init();
    native_state_init();
    ESP_LOGI(TAG, "yoRadio ESP8266 RTOS SDK native starting");
    ESP_LOGI(TAG, "CPU: %u MHz; free heap: %u",
             CONFIG_ESP8266_DEFAULT_CPU_FREQ_MHZ,
             esp_get_free_heap_size());
#if YORADIO_ESP8266_SPI_PDM
    ESP_LOGI(TAG,
             "profile: HTTP only, Helix MP3/AAC, SPI-PDM GPIO %d at %u Hz",
             BOARD_SPI_PDM_DATA_GPIO, BOARD_SPI_PDM_BIT_RATE_HZ);
#elif YORADIO_ESP8266_I2S_PDM && CONFIG_YORADIO_AUDIO_OUTPUT_I2S_RCPDM
    ESP_LOGI(TAG,
             "profile: HTTP only, Helix MP3/AAC, I2S RCPDM DMA GPIO %d, "
             "carrier %u Hz, alpha=1/16; UART RX ignored",
             BOARD_I2S_DATA_GPIO, BOARD_I2S_PDM_CARRIER_HZ);
#elif YORADIO_ESP8266_I2S_PDM
    ESP_LOGI(TAG,
             "profile: HTTP only, Helix MP3/AAC, I2S-PDM DMA GPIO %d, "
             "carrier %u Hz, PDM%u x%u; UART RX ignored",
             BOARD_I2S_DATA_GPIO, BOARD_I2S_PDM_CARRIER_HZ,
             BOARD_I2S_PDM_OVERSAMPLE, BOARD_I2S_PDM_REPEAT);
#else
    ESP_LOGI(TAG, "profile: HTTP only, Helix MP3/AAC, I2S GPIO %d/%d/%d",
             BOARD_I2S_DATA_GPIO, BOARD_I2S_BCLK_GPIO,
             BOARD_I2S_LRCLK_GPIO);
#endif

    esp_err_t result = nvs_flash_init();
    if (result == ESP_ERR_NVS_NO_FREE_PAGES) {
        ESP_ERROR_CHECK(nvs_flash_erase());
        result = nvs_flash_init();
    }
    ESP_ERROR_CHECK(result);
    ESP_ERROR_CHECK(persistent_settings_init());
#if CONFIG_YORADIO_OLED
    ESP_ERROR_CHECK(display_service_start());
#else
    ESP_LOGI(TAG, "OLED disabled: WebUI-only low-memory profile");
#endif
    ESP_ERROR_CHECK(audio_service_init());
    /* Install the I2S/SLC ISR and allocate its fixed DMA ring before Wi-Fi
     * starts consuming and fragmenting the small ESP8266 heap. The ring emits
     * neutral PDM until decoded PCM becomes available. */
    ESP_ERROR_CHECK(native_audio_output_init());
#if CONFIG_YORADIO_STATUS_LED
    ESP_ERROR_CHECK(status_led_init());
#endif
    result = storage_service_init();
    if (result == ESP_OK) {
        spiffs_log_mount_ready();
        result = playlist_service_init();
        if (result != ESP_OK && result != ESP_ERR_NOT_FOUND)
            ESP_LOGE(TAG, "Playlist initialization failed: %s",
                     esp_err_to_name(result));
        native_state_set_station_count(playlist_service_count());
    }
    esp_err_t radio_result = radio_control_init();
    if (radio_result != ESP_OK && radio_result != ESP_ERR_NOT_FOUND)
        ESP_LOGW(TAG, "Radio control initialization: %s",
                 esp_err_to_name(radio_result));
    ESP_ERROR_CHECK(input_service_start());
    ESP_ERROR_CHECK(time_service_start());
    ESP_ERROR_CHECK(network_service_start());
    ESP_ERROR_CHECK(web_service_start());

    /* Background poll scheduling: LED-only wakeups must not enqueue HTTP
     * work (a control-socket/lwIP operation) or run the other services. Real
     * BOOT/state notifications still service controls and WebUI immediately. */
    const TickType_t service_period = pdMS_TO_TICKS(250);
    TickType_t service_tick = xTaskGetTickCount();
    uint32_t notifications = 1;
    for (;;) {
#if YORADIO_ESP8266_OPUS_PCM_APP_TASK
        audio_pcm_queue_poll();
        uint32_t service_started = (uint32_t)esp_timer_get_time();
        uint32_t service_misses = esp8266_nodac_i2s_underruns();
#endif
        input_service_poll();
#if YORADIO_ESP8266_OPUS_PCM_APP_TASK
        /* Do not enqueue HTTP work for every PCM/DMA wake. Actual state
         * changes remain latched across output waits and are handled now. */
        notifications = native_state_take_service_notification();
#endif
        TickType_t now = xTaskGetTickCount();
        if (notifications || (TickType_t)(now - service_tick) >= service_period) {
            service_tick = now;
            radio_control_flush_pending();
            network_service_poll();
            time_service_poll();
            web_service_poll();
            memory_profile_poll();
            spiffs_log_poll();
        }
#if CONFIG_YORADIO_STATUS_LED
        status_led_poll();
#endif
        TickType_t elapsed = xTaskGetTickCount() - service_tick;
        TickType_t wait = elapsed >= service_period ? 0 : service_period - elapsed;
        wait = input_service_wait_ticks(wait);
#if CONFIG_YORADIO_STATUS_LED
        wait = status_led_wait_ticks(wait);
#endif
#if YORADIO_ESP8266_OPUS_PCM_APP_TASK
        if (audio_pcm_queue_pending()) wait = 0;
        audio_pcm_queue_record_service((uint32_t)esp_timer_get_time() - service_started,
            esp8266_nodac_i2s_underruns() - service_misses);
#endif
        notifications = ulTaskNotifyTake(pdTRUE, wait);
    }
    /* End background poll scheduling. */
#endif
}
